<!-- add-pr-comment:eks_plan -->

# staging/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_access_key.signoz_smtp_user_key[0] will be created
  + resource "aws_iam_access_key" "signoz_smtp_user_key" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "signoz-staging"
    }
  # aws_iam_role.signoz[0] will be created
  + resource "aws_iam_role" "signoz" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:signoz:signoz"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "signoz-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # aws_iam_role_policy_attachment.parameters_csi_signoz[0] will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_signoz" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/parameters-csi-policy"
      + role       = "signoz-eks-role"
    }
  # aws_iam_role_policy_attachment.secrets_csi_signoz[0] will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_signoz" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
      + role       = "signoz-eks-role"
    }
  # aws_iam_role_policy_attachment.signoz_worker[0] will be created
  + resource "aws_iam_role_policy_attachment" "signoz_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/notification-worker-policy"
      + role       = "signoz-eks-role"
    }
  # aws_iam_user.signoz_smtp_user[0] will be created
  + resource "aws_iam_user" "signoz_smtp_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "signoz-staging"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }
  # aws_iam_user_policy.signoz_smtp_user_policy[0] will be created
  + resource "aws_iam_user_policy" "signoz_smtp_user_policy" {
      + id          = (known after apply)
      + name        = "ses-smtp-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ses:SendRawEmail",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "signoz-staging"
    }
Plan: 7 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---